rf-codeigniter-4-peminjaman-buku/rf-codeigniter-4-peminjaman-buku-src/app/Controllers/Member.php

    public function index()
    {
        $configModel = model("Config");

        $siteName = $configModel->getValue('SITE_NAME', 'Perpustakaan Online');
        $adminPagination = $configModel->getValue('ADMIN_PAGINATION', '10');

        //
        $model = new MemberModel();
        $data['members'] = $model->paginate((int)$adminPagination);
---
SELECT *
FROM `members`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `members`