rf_ci_rest_api/rf_ci_rest_api_src/app/Controllers/AuthController.php

    public function login()
    {
        $data = $this->request->getJSON(true) ?? $this->request->getPost();
        if (!is_array($data) || empty($data['username']) || empty($data['password'])) {
            return $this->response->setStatusCode(422)->setJSON(['status' => 'error', 'message' => 'username and password are required']);
        }

        $model = new UserModel();
        $user  = $model->where('username', $data['username'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1