rf_peminjaman_buku/rf_peminjaman_buku_src/app/Controllers/Account.php

SELECT *
FROM `users`
WHERE `id` = 1
 LIMIT 1
---
    public function index()
    {
        //
        $configModel = model("Config");

        $siteName = $configModel->getValue('SITE_NAME', 'Perpustakaan Online');
        // $title = "$siteName - Account";

        $userModel = model("UserModel");

        $pair = session()->get();
        // G::ddp($pair);

        $account = $userModel->where('id', $pair['user_id'])->first();