rf_codeigniter4_chart_js_example/rf_codeigniter4_chart_js_example_src/app/Models/ProductModel.php

    public function getCategorySummary()
    {
        return $this->select("category, SUM(amount) as total")
                    ->groupBy("category")
                    ->orderBy("category", "ASC")
                    ->findAll();
---
SELECT `category`, SUM(amount) as total
FROM `products`
GROUP BY `category`
ORDER BY `category` ASC