rf_ci_chart_js/rf_ci_chart_js_src/app/Models/SaleModel.php

    public function getSalesSummary()
    {
        return $this->select("DATE(date) as sale_date, SUM(amount) as total")
                    ->groupBy("DATE(date)")
                    ->orderBy("sale_date", "ASC")
                    ->findAll();
---
SELECT DATE(date) as sale_date, SUM(amount) as total
FROM `sales`
GROUP BY DATE(date)
ORDER BY `sale_date` ASC