rf-codeigniter-4-peminjaman-buku/rf-codeigniter-4-peminjaman-buku-src/app/Models/Config.php

SELECT *
FROM `configs`
WHERE `key` = 'SITE_NAME'
 LIMIT 1
---
    public function getValue(string $key, $default = null)
    {
        $result = $this->where('key', $key)->first();